In [ ]:
import numpy as np
import pandas as pd
import plotly.express as px
import sqlalchemy
from pathlib import Path
from zipfile import ZipFile

with ZipFile('dataElections.zip', 'r') as zipObj:
   # Extract all the contents of zip file in current directory
   zipObj.extractall()
    
engine = sqlalchemy.create_engine("sqlite:///imdbmini.db")
connection = engine.connect()

In [24]:
%reload_ext sql

In [25]:
%sql sqlite:///imdbmini.db

In [26]:
%%sql
SELECT sql FROM sqlite_master WHERE type='table';

 * sqlite:///imdbmini.db
Done.

[('CREATE TABLE "Title" (\n"tconst" INTEGER,\n  "titleType" TEXT,\n  "primaryTitle" TEXT,\n  "originalTitle" TEXT,\n  "isAdult" TEXT,\n  "startYear" TEXT,\n  "endYear" TEXT,\n  "runtimeMinutes" TEXT,\n  "genres" TEXT\n)',),
 ('CREATE TABLE "Name" (\n"nconst" INTEGER,\n  "primaryName" TEXT,\n  "birthYear" TEXT,\n  "deathYear" TEXT,\n  "primaryProfession" TEXT\n)',),
 ('CREATE TABLE "Role" (\ntconst INTEGER,\nordering TEXT,\nnconst INTEGER,\ncategory TEXT,\njob TEXT,\ncharacters TEXT\n)',),
 ('CREATE TABLE "Rating" (\ntconst INTEGER,\naverageRating TEXT,\nnumVotes TEXT\n)',)]

In [27]:
%%sql
SELECT *
FROM Title
LIMIT 5;

 * sqlite:///imdbmini.db
Done.

[(417, 'short', 'A Trip to the Moon', 'Le voyage dans la lune', '0', '1902', None, '13', 'Action,Adventure,Comedy'),
 (4972, 'movie', 'The Birth of a Nation', 'The Birth of a Nation', '0', '1915', None, '195', 'Drama,History,War'),
 (10323, 'movie', 'The Cabinet of Dr. Caligari', 'Das Cabinet des Dr. Caligari', '0', '1920', None, '76', 'Fantasy,Horror,Mystery'),
 (12349, 'movie', 'The Kid', 'The Kid', '0', '1921', None, '68', 'Comedy,Drama,Family'),
 (13442, 'movie', 'Nosferatu', 'Nosferatu, eine Symphonie des Grauens', '0', '1922', None, '94', 'Fantasy,Horror')]

In [28]:
%%sql
SELECT *
FROM Name
LIMIT 5;

 * sqlite:///imdbmini.db
Done.

[(1, 'Fred Astaire', '1899', '1987', 'soundtrack,actor,miscellaneous'),
 (2, 'Lauren Bacall', '1924', '2014', 'actress,soundtrack'),
 (3, 'Brigitte Bardot', '1934', None, 'actress,soundtrack,music_department'),
 (4, 'John Belushi', '1949', '1982', 'actor,soundtrack,writer'),
 (5, 'Ingmar Bergman', '1918', '2007', 'writer,director,actor')]

In [29]:
%%sql
SELECT *
FROM Role
LIMIT 5;

 * sqlite:///imdbmini.db
Done.

[(417, '1', 617588, 'actor', None, '["Prof. Barbenfouillis","The Moon"]'),
 (417, '2', 29244, 'actor', None, '["Astronomer"]'),
 (417, '3', 76933, 'actress', None, '["Lady in the Moon"]'),
 (417, '4', 1215996, 'actor', None, '["Astronomer"]'),
 (417, '5', 894523, 'writer', 'novel "De la Terre à la Lune"', None)]

In [30]:
%%sql
SELECT *
FROM Rating
LIMIT 5;

 * sqlite:///imdbmini.db
Done.

[(417, '8.2', '46382'),
 (4972, '6.3', '23836'),
 (10323, '8.1', '60244'),
 (12349, '8.3', '120059'),
 (13442, '7.9', '92218')]

In [32]:
query = """
    SELECT DISTINCT titleType
    FROM Title;
"""

data = pd.read_sql(query, engine)
data

      titleType
0         short
1         movie
2      tvSeries
3       tvMovie
4  tvMiniSeries
5         video
6     videoGame
7     tvEpisode
8     tvSpecial

In [ ]:
query2 = """
    SELECT tconst, titleType, 
    FROM Title
    JOIN Role, Rating 
"""

data2 = pd.read_sql(query2, engine)